In [2]:
import pandas as pd

In [4]:
df1 = pd.DataFrame({'ID': [1, 2, 3],
                    'Nombre': ['Ana', 'Luis', 'Carlos']})
df2 = pd.DataFrame({'ID': [1, 2, 4],
                    'Edad': [25, 30, 22]})

In [6]:
df1

   ID  Nombre
0   1     Ana
1   2    Luis
2   3  Carlos

In [8]:
df2

   ID  Edad
0   1    25
1   2    30
2   4    22

In [26]:
df_combinado = pd.merge(df1,df2,on="ID", how="right")
df_combinado

   ID Nombre  Edad
0   1    Ana    25
1   2   Luis    30
2   4    NaN    22

In [18]:
df_indexado = pd.merge(df1,df2, left_index=True, right_index=True)
df_indexado

   ID_x  Nombre  ID_y  Edad
0     1     Ana     1    25
1     2    Luis     2    30
2     3  Carlos     4    22

In [28]:
libros = pd.DataFrame({
    'ID': [1, 2, 3, 4],
    'titulo': ['El Quijote', 'La Odisea', 'Cien Años de Soledad', 'El Principito']
})

autores = pd.DataFrame({
    'ID': [1, 2, 3, 5],
    'nombre': ['Miguel de Cervantes', 'Homero', 'Gabriel García Márquez', 'J.K. Rowling']
})

In [56]:
df1 = pd.DataFrame(libros)
df2 = pd.DataFrame(autores)

cursos_inscripciones = pd.merge(cursos,inscripciones, left_index=True, right_index=True)libros_autores

   ID                titulo                  nombre
0   1            El Quijote     Miguel de Cervantes
1   2             La Odisea                  Homero
2   3  Cien Años de Soledad  Gabriel García Márquez
3   4         El Principito                     NaN
4   5                   NaN            J.K. Rowling

In [58]:
cursos = pd.DataFrame({
    'curso_id': [101, 102, 103],
    'nombre_curso': ['Introducción a Python', 'Data Science con Python', 'Machine Learning Avanzado']
})

inscripciones = pd.DataFrame({
    'curso_id': [102, 102, 101, 104],
    'fecha_inscripcion': ['2023-01-15', '2023-02-01', '2023-01-20', '2023-03-05']
})

In [73]:
cursos_inscripciones = pd.merge(inscripciones, cursos, on='curso_id', how='left')
cursos_inscripciones

   curso_id             nombre_curso fecha_inscripcion
0       102  Data Science con Python        2023-01-15
1       102  Data Science con Python        2023-02-01
2       101    Introducción a Python        2023-01-20
3       104                      NaN        2023-03-05